In [40]:
import pandas as pd

In [42]:
chicago=pd.read_csv("/Users/prashantsagar/Desktop/Data analysis/csvfile/chicago.csv").dropna(how="all")
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [4]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null object
Employee Annual Salary    32062 non-null object
dtypes: object(4)
memory usage: 1002.1+ KB

In [6]:
chicago["Department"].nunique()

35

In [7]:
chicago.nunique()

Name                      31776
Position Title             1093
Department                   35
Employee Annual Salary     1156
dtype: int64

In [11]:
chicago["Department"]=chicago["Department"].astype("category")

In [12]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [13]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

# common string lower, uppeer,title, len

In [14]:
chicago["Name"].str.lower()

0            aaron,  elvia j
1          aaron,  jeffery m
2             aaron,  karina
3        aaron,  kimberlei r
4        abad jr,  vicente m
                ...
32058     zygowicz,  peter j
32059      zymantas,  mark e
32060    zyrkowski,  carlo e
32061    zyskowski,  dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [15]:
chicago['Position Title'].str.upper()

0                WATER RATE TAKER
1                  POLICE OFFICER
2                  POLICE OFFICER
3        CHIEF CONTRACT EXPEDITER
4               CIVIL ENGINEER IV
                   ...
32058              POLICE OFFICER
32059              POLICE OFFICER
32060              POLICE OFFICER
32061     CHIEF DATA BASE ANALYST
32062                         NaN
Name: Position Title, Length: 32063, dtype: object

In [16]:
chicago["Employee Annual Salary"].str.len()

0         9.0
1         9.0
2         9.0
3         9.0
4        10.0
         ...
32058     9.0
32059     9.0
32060     9.0
32061    10.0
32062     NaN
Name: Employee Annual Salary, Length: 32063, dtype: float64

In [18]:
chicago["Name"].str.title()
# it return first letter in captial form

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

# replace method

In [25]:
chicago["Department"]=chicago["Department"].str.replace("MGMNT","Management")

In [26]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER Management,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER Management,$106836.00

# filter wid string method

In [32]:
mask=chicago['Position Title'].str.lower().str.contains("police")
chicago[mask]

                        Name  Position Title Department Employee Annual Salary
1          AARON,  JEFFERY M  POLICE OFFICER     POLICE              $84450.00
2             AARON,  KARINA  POLICE OFFICER     POLICE              $84450.00
11          ABBATE,  TERRY M  POLICE OFFICER     POLICE              $90618.00
15           ABDALLAH,  ZAID  POLICE OFFICER     POLICE              $74028.00
16     ABDELHADI,  ABDALMAHD  POLICE OFFICER     POLICE              $81588.00
...                      ...             ...        ...                    ...
32054         ZYCH,  MATEUSZ  POLICE OFFICER     POLICE              $46668.00
32055          ZYDEK,  BRYAN  POLICE OFFICER     POLICE              $81588.00
32058     ZYGOWICZ,  PETER J  POLICE OFFICER     POLICE              $87384.00
32059      ZYMANTAS,  MARK E  POLICE OFFICER     POLICE              $84450.00
32060    ZYRKOWSKI,  CARLO E  POLICE OFFICER     POLICE              $87384.00

[10905 rows x 4 columns]

In [34]:
chicago[chicago['Position Title'].str.lower().str.startswith("police")]
# start with

                        Name  Position Title Department Employee Annual Salary
1          AARON,  JEFFERY M  POLICE OFFICER     POLICE              $84450.00
2             AARON,  KARINA  POLICE OFFICER     POLICE              $84450.00
11          ABBATE,  TERRY M  POLICE OFFICER     POLICE              $90618.00
15           ABDALLAH,  ZAID  POLICE OFFICER     POLICE              $74028.00
16     ABDELHADI,  ABDALMAHD  POLICE OFFICER     POLICE              $81588.00
...                      ...             ...        ...                    ...
32054         ZYCH,  MATEUSZ  POLICE OFFICER     POLICE              $46668.00
32055          ZYDEK,  BRYAN  POLICE OFFICER     POLICE              $81588.00
32058     ZYGOWICZ,  PETER J  POLICE OFFICER     POLICE              $87384.00
32059      ZYMANTAS,  MARK E  POLICE OFFICER     POLICE              $84450.00
32060    ZYRKOWSKI,  CARLO E  POLICE OFFICER     POLICE              $87384.00

[10856 rows x 4 columns]

In [35]:
chicago[chicago['Position Title'].str.lower().str.endswith("er")]
# end with

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER Management,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
11,"ABBATE, TERRY M",POLICE OFFICER,POLICE,$90618.00
...,...,...,...,...
32054,"ZYCH, MATEUSZ",POLICE OFFICER,POLICE,$46668.00
32055,"ZYDEK, BRYAN",POLICE OFFICER,POLICE,$81588.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00

# spaceing    lstrip,  rstrip & srtip to remove white spaceing

In [39]:
chicago['Name'].str.lstrip().str.rstrip().str.strip()
# it remove all the white spaceing

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32057    ZYGADLO,  MICHAEL J
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32062, dtype: object

# split method

In [43]:
'HEllO PRASHANT, HOPE YOU DOING WELL'.split()
# it slpit all the words with space

['HEllO', 'PRASHANT,', 'HOPE', 'YOU', 'DOING', 'WELL']